       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       DATA DIVISION.
          WORKING-STORAGE SECTION.
          01 WS-CNT PIC 9(1) VALUE 0. 

       PROCEDURE DIVISION.
          A-PARA.
          PERFORM B-PARA WITH TEST AFTER UNTIL WS-CNT>3.
          STOP RUN.

          B-PARA.
          DISPLAY 'WS-CNT : 'WS-CNT.
          ADD 1 TO WS-CNT.
       IF XFER-HOLD-INDICATOR = 'P' OR 'D'
          MOVE XFER-HOLD-INDICATOR TO HOLD-AREA-TYPE
          PERFORM K-100-HOLD-RESTORE
       ELSE
          PERFORM A-100-OUTPUT-INIT
          IF CONTINUE-PROCESS
              PERFORM B-100-OUTPUT-EDITS.
